espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/radio/mac/rail_mux/sl_rail_mux.c
/***************************************************************************//**
 * @file sl_rail_mux.c
 * @brief RAIL Multiplexer implementation
 *******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/

#include PLATFORM_HEADER

#ifndef SLI_COEX_SUPPORTED
#define SLI_COEX_SUPPORTED 1
#endif // SLI_COEX_SUPPORTED

#ifndef SLI_ANTDIV_SUPPORTED
#define SLI_ANTDIV_SUPPORTED 1
#endif // SLI_ANTDIV_SUPPORTED

#define SLI_DMP_TUNING_SUPPORTED SLI_COEX_SUPPORTED // DMP_TUNING requires COEX

#include "rail.h"
#include "rail_ieee802154.h"
#include "rail_module.h"
#include "rail_util_ieee802154/sl_rail_util_ieee802154_phy_select.h"
#ifdef SL_RAIL_UTIL_PA_CONFIG_HEADER
#include SL_RAIL_UTIL_PA_CONFIG_HEADER
#endif
#include "em_common.h" // for SL_WEAK

#include "sl_rail_mux.h"

#include "buffer_manager/buffer-management.h"
#include "buffer_manager/buffer-queue.h"

//------------------------------------------------------------------------------
// Forward declarations

static void fn_update_current_tx_power(void);
static void fn_set_global_flag(uint16_t flag, bool val);
static bool fn_get_global_flag(uint16_t flag);
static uint8_t fn_get_context_index(RAIL_Handle_t handle);
static void fn_set_context_flag_by_index(uint8_t index, uint16_t flag, bool val);
static bool fn_get_context_flag_by_index(uint8_t index, uint16_t flag);
static uint8_t fn_get_context_index(RAIL_Handle_t handle);
static void fn_init_802154_address_config(RAIL_IEEE802154_AddrConfig_t *addr_config);
static void fn_update_802154_address_filtering_table(void);
static RAIL_Status_t fn_start_pending_tx(void);
static bool fn_operation_in_progress(uint16_t operation_flags);
static uint8_t fn_get_active_tx_context_index(void);

HIDDEN void fn_mux_rail_init_callback(RAIL_Handle_t railHandle);
HIDDEN void fn_mux_rail_events_callback(RAIL_Handle_t railHandle, RAIL_Events_t events);
HIDDEN void fn_timer_callback(struct RAIL_MultiTimer *tmr,
                              RAIL_Time_t expectedTimeOfEvent,
                              void *cbArg);

#define tx_in_progress()                                          \
  fn_operation_in_progress(RAIL_MUX_PROTOCOL_FLAGS_TX_IN_PROGRESS \
                           | RAIL_MUX_PROTOCOL_FLAGS_WAIT_FOR_ACK)

// (If no lock is active || lock acquired by current context_index )
#define check_lock_permissions(context_index)                     \
  (!fn_operation_in_progress(RAIL_MUX_PROTOCOL_FLAGS_LOCK_ACTIVE) \
   || fn_get_context_flag_by_index(context_index, RAIL_MUX_PROTOCOL_FLAGS_LOCK_ACTIVE) )
//------------------------------------------------------------------------------
// Globals

RAIL_Handle_t emPhyRailHandle = NULL;
#define mux_rail_handle emPhyRailHandle

static volatile uint16_t internal_flags = 0;
static RAIL_TxPower_t current_tx_power = RAIL_TX_POWER_MIN;
static uint16_t rx_channel = INVALID_CHANNEL;
static RAIL_IEEE802154_AddrConfig_t rail_addresses_802154;
static RAILSched_Config_t mux_scheduler_config;

HIDDEN sl_rail_mux_context_t protocol_context[SUPPORTED_PROTOCOL_COUNT];

HIDDEN RAIL_Config_t mux_rail_config = {
  .eventsCallback = fn_mux_rail_events_callback,
  .protocol = NULL, // only used by Bluetooth stack
  .scheduler = &mux_scheduler_config,
};

HIDDEN const RAIL_IEEE802154_Config_t ieee_802154_config = {
  NULL, // addresses
  {
    // ackConfig
    true, // ackConfig.enable
    672,  // ackConfig.ackTimeout
    {
      // ackConfig.rxTransitions
      RAIL_RF_STATE_RX,   // ackConfig.rxTransitions.success
      RAIL_RF_STATE_RX,   // ackConfig.rxTransitions.error
    },
    {
      // ackConfig.txTransitions
      RAIL_RF_STATE_RX,   // ackConfig.txTransitions.success
      RAIL_RF_STATE_RX,   // ackConfig.txTransitions.error
    },
  },
  {
    // timings
    100,      // timings.idleToRx
    192 - 10, // timings.txToRx
    100,      // timings.idleToTx
    256,      // timings.rxToTx - This is set to 256 to accommodate enhanced
              // ACKs (part of OT >= 1.2), regular value would 192.
    0,        // timings.rxSearchTimeout
    0,        // timings.txToRxSearchTimeout
    0,        // timings.txToTx
  },
  RAIL_IEEE802154_ACCEPT_STANDARD_FRAMES, // framesMask
  false,                                  // promiscuousMode
  false,                                  // isPanCoordinator
  false,                                  // defaultFramePendingInOutgoingAcks
};

//------------------------------------------------------------------------------
// Internal APIs

void sli_rail_mux_local_init(void)
{
  uint8_t i;

  // We use the RAIL config pointer to indicate whether an entry is already in
  // use or not.
  for (i = 0; i < SUPPORTED_PROTOCOL_COUNT; i++) {
    protocol_context[i].rail_config = NULL;
    protocol_context[i].events = 0;
    protocol_context[i].flags = 0;
    protocol_context[i].fifo_tx_info.tx_init_length = 0;
    protocol_context[i].fifo_tx_info.tx_size = 0;

    protocol_context[i].channel = INVALID_CHANNEL;
    protocol_context[i].tx_repeat_config.iterations = 0;
    protocol_context[i].tx_power = RAIL_TX_POWER_MIN;
    // 802.15.4 specific fields
    fn_init_802154_address_config(&protocol_context[i].addr_802154);
    protocol_context[i].is_pan_coordinator_802154 = false;
    // Initialize to address broadcast and PAN broadcast
    protocol_context[i].addr_filter_mask_802154 = RAIL_FILTERING_MASK_BROADCAST_ENABLED;
  }

  internal_flags = 0;
  rx_channel = INVALID_CHANNEL;
  fn_init_802154_address_config(&rail_addresses_802154);

  // TODO: for now we assume all protocols to be 802.15.4 and use the 2.4 OQPSK
  // standard PHY. In order to support SubGHz PHY, we will need to modify the
  // rail_config accordingly.
}

//------------------------------------------------------------------------------
// Public APIs

RAIL_Handle_t sl_rail_mux_Init(RAIL_Config_t *railCfg,
                               RAIL_InitCompleteCallbackPtr_t cb)
{
  RAIL_MUX_DECLARE_IRQ_STATE;
  uint8_t i;

