espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/radio/mac/rail_mux/sl_rail_mux.c
  // TODO: Maintain separate options per protocol? Complain if there is some
  // conflict among the protocols' options?
  // For now we can skip this since both MAC layers configure the same RX
  // options.

  return RAIL_ConfigRxOptions(mux_rail_handle, mask, options);
}

RAIL_Status_t sl_rail_mux_SetTaskPriority(RAIL_Handle_t railHandle,
                                          uint8_t priority,
                                          RAIL_TaskType_t taskType)
{
  (void)railHandle;

  return RAIL_SetTaskPriority(mux_rail_handle, priority, taskType);
}

RAIL_Status_t sl_rail_mux_IEEE802154_Config2p4GHzRadio(RAIL_Handle_t railHandle)
{
  (void)railHandle;

  return RAIL_IEEE802154_Config2p4GHzRadio(mux_rail_handle);
}

uint16_t sl_rail_mux_ConfigChannels(RAIL_Handle_t railHandle,
                                    const RAIL_ChannelConfig_t *config,
                                    RAIL_RadioConfigChangedCallback_t cb)
{
  (void)railHandle;

  // TODO: this currently only called from Zigbee in simulation.

  return RAIL_ConfigChannels(mux_rail_handle, config, cb);
}

RAIL_Status_t sl_rail_mux_ConvertLqi(RAIL_Handle_t railHandle,
                                     RAIL_ConvertLqiCallback_t cb)
{
  (void)railHandle;

  // The callback does not pass up a RAIL_Handle_t reference, so we can just
  // pass the callback from the upper layer down to RAIL.

  return RAIL_ConvertLqi(mux_rail_handle, cb);
}

RAIL_Status_t sl_rail_mux_Calibrate(RAIL_Handle_t railHandle,
                                    RAIL_CalValues_t *calValues,
                                    RAIL_CalMask_t calForce)
{
  (void)railHandle;

  return RAIL_Calibrate(mux_rail_handle, calValues, calForce);
}

RAIL_Status_t sl_rail_mux_IEEE802154_CalibrateIr2p4Ghz(RAIL_Handle_t railHandle,
                                                       uint32_t *imageRejection)
{
  (void)railHandle;

  return RAIL_IEEE802154_CalibrateIr2p4Ghz(mux_rail_handle, imageRejection);
}

uint16_t sl_rail_mux_GetRadioEntropy(RAIL_Handle_t railHandle,
                                     uint8_t *buffer,
                                     uint16_t bytes)
{
  (void)railHandle;

  return RAIL_GetRadioEntropy(mux_rail_handle, buffer, bytes);
}

RAIL_Status_t sl_rail_mux_IsValidChannel(RAIL_Handle_t railHandle, uint16_t channel)
{
  (void)railHandle;

  return RAIL_IsValidChannel(mux_rail_handle, channel);
}

int16_t sl_rail_mux_GetRssi(RAIL_Handle_t railHandle, bool wait)
{
  (void)railHandle;

  return RAIL_GetRssi(mux_rail_handle, wait);
}

uint32_t sl_rail_mux_GetSymbolRate(RAIL_Handle_t railHandle)
{
  (void)railHandle;

  return RAIL_GetSymbolRate(mux_rail_handle);
}

uint32_t sl_rail_mux_GetBitRate(RAIL_Handle_t railHandle)
{
  (void)railHandle;

  return RAIL_GetBitRate(mux_rail_handle);
}

RAIL_Status_t sl_rail_mux_SetFreqOffset(RAIL_Handle_t railHandle,
                                        RAIL_FrequencyOffset_t freqOffset)
{
  (void)railHandle;

  return RAIL_SetFreqOffset(mux_rail_handle, freqOffset);
}

RAIL_Status_t sl_rail_mux_SetTimer(RAIL_Handle_t railHandle,
                                   RAIL_Time_t time,
                                   RAIL_TimeMode_t mode,
                                   RAIL_TimerCallback_t cb)
{
  uint8_t context_index = fn_get_context_index(railHandle);
  assert(context_index < SUPPORTED_PROTOCOL_COUNT);

  protocol_context[context_index].timer_callback = cb;

  return RAIL_SetMultiTimer(&protocol_context[context_index].timer,
                            time,
                            mode,
                            (cb == NULL) ? NULL : fn_timer_callback,
                            railHandle);
}

void sl_rail_mux_CancelTimer(RAIL_Handle_t railHandle)
{
  uint8_t context_index = fn_get_context_index(railHandle);
  assert(context_index < SUPPORTED_PROTOCOL_COUNT);

  RAIL_CancelMultiTimer(&protocol_context[context_index].timer);
}

RAIL_CalMask_t sl_rail_mux_GetPendingCal(RAIL_Handle_t railHandle)
{
  (void)railHandle;

  return RAIL_GetPendingCal(mux_rail_handle);
}

RAIL_Status_t sl_rail_mux_CalibrateTemp(RAIL_Handle_t railHandle)
{
  (void)railHandle;

  return RAIL_CalibrateTemp(mux_rail_handle);
}

RAIL_RxPacketHandle_t sl_rail_mux_GetRxPacketInfo(RAIL_Handle_t railHandle,
                                                  RAIL_RxPacketHandle_t packetHandle,
                                                  RAIL_RxPacketInfo_t *pPacketInfo)
{
  (void)railHandle;

  return RAIL_GetRxPacketInfo(mux_rail_handle, packetHandle, pPacketInfo);
}

RAIL_Status_t sl_rail_mux_GetRxPacketDetailsAlt(RAIL_Handle_t railHandle,
                                                RAIL_RxPacketHandle_t packetHandle,
                                                RAIL_RxPacketDetails_t *pPacketDetails)
{
  (void)railHandle;

  return RAIL_GetRxPacketDetailsAlt(mux_rail_handle,
                                    packetHandle,
                                    pPacketDetails);
}

RAIL_Status_t sl_rail_mux_GetRxTimeSyncWordEnd(RAIL_Handle_t railHandle,
                                               uint16_t totalPacketBytes,
                                               RAIL_Time_t *pPacketTime)
{
  (void)railHandle;

  return RAIL_GetRxTimeSyncWordEnd(mux_rail_handle,
                                   totalPacketBytes,
                                   pPacketTime);
}

uint16_t sl_rail_mux_PeekRxPacket(RAIL_Handle_t railHandle,
                                  RAIL_RxPacketHandle_t packetHandle,
                                  uint8_t *pDst,
                                  uint16_t len,
                                  uint16_t offset)
{
  (void)railHandle;

  return RAIL_PeekRxPacket(mux_rail_handle,
                           packetHandle,
                           pDst,
                           len,
                           offset);
}

RAIL_Status_t sl_rail_mux_IEEE802154_GetAddress(RAIL_Handle_t railHandle,
                                                RAIL_IEEE802154_Address_t *pAddress)
{
  (void)railHandle;

  return RAIL_IEEE802154_GetAddress(mux_rail_handle, pAddress);
}

void sl_rail_mux_GetRxIncomingPacketInfo(RAIL_Handle_t railHandle,
                                         RAIL_RxPacketInfo_t *pPacketInfo)
{
  (void)railHandle;

