espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/radio/mac/rail_mux/sl_rail_mux.c
  RAIL_GetRxIncomingPacketInfo(mux_rail_handle, pPacketInfo);
  return;
}

int8_t sl_rail_mux_GetRssiOffset(RAIL_Handle_t railHandle)
{
  (void)railHandle;

  return RAIL_GetRssiOffset(mux_rail_handle);
}

RAIL_Status_t sl_rail_mux_IEEE802154_SetFramePending(RAIL_Handle_t railHandle)
{
  (void)railHandle;

  return RAIL_IEEE802154_SetFramePending(mux_rail_handle);
}

RAIL_SchedulerStatus_t sl_rail_mux_GetSchedulerStatus(RAIL_Handle_t railHandle)
{
  (void)railHandle;

  return RAIL_GetSchedulerStatus(mux_rail_handle);
}

bool sl_rail_mux_IsRxAutoAckPaused(RAIL_Handle_t railHandle)
{
  (void)railHandle;

  return RAIL_IsRxAutoAckPaused(mux_rail_handle);
}

RAIL_Status_t sl_rail_mux_GetTxPowerConfig(RAIL_Handle_t railHandle,
                                           RAIL_TxPowerConfig_t *config)
{
  (void)railHandle;

  return RAIL_GetTxPowerConfig(mux_rail_handle, config);
}

RAIL_TxPower_t sl_rail_mux_GetTxPowerDbm(RAIL_Handle_t railHandle)
{
  (void)railHandle;

  return RAIL_GetTxPowerDbm(mux_rail_handle);
}

RAIL_Status_t sl_rail_mux_GetChannel(RAIL_Handle_t railHandle, uint16_t *channel)
{
  (void)railHandle;

  return RAIL_GetChannel(mux_rail_handle, channel);
}

RAIL_TxPower_t sl_rail_mux_GetTxPower(RAIL_Handle_t railHandle)
{
  (void) railHandle;
  return RAIL_GetTxPower(mux_rail_handle);
}

RAIL_Status_t sl_rail_mux_ConfigTxPower(RAIL_Handle_t railHandle,
                                        const RAIL_TxPowerConfig_t *config)
{
  RAIL_MUX_DECLARE_IRQ_STATE;
  uint16_t status = RAIL_STATUS_NO_ERROR;
  (void)railHandle;

  RAIL_MUX_ENTER_CRITICAL();

  if (!fn_get_global_flag(RAIL_MUX_FLAGS_RAIL_CONFIG_TX_POWER_DONE)) {
#ifdef SL_RAIL_UTIL_PA_CONFIG_HEADER
    (void)config;
    RAIL_TxPowerConfig_t txPowerConfig = { SL_RAIL_UTIL_PA_SELECTION_2P4GHZ,
                                           SL_RAIL_UTIL_PA_VOLTAGE_MV,
                                           SL_RAIL_UTIL_PA_RAMP_TIME_US };
    status = RAIL_ConfigTxPower(mux_rail_handle, &txPowerConfig);
#else // !SL_RAIL_UTIL_PA_CONFIG_HEADER
    status = RAIL_ConfigTxPower(mux_rail_handle, config);
#endif // SL_RAIL_UTIL_PA_CONFIG_HEADER

    fn_set_global_flag(RAIL_MUX_FLAGS_RAIL_CONFIG_TX_POWER_DONE, true);
  }

  RAIL_MUX_EXIT_CRITICAL();

  return status;
}

RAIL_Status_t sl_rail_mux_SetTxPowerDbm(RAIL_Handle_t railHandle,
                                        RAIL_TxPower_t power)
{
  RAIL_MUX_DECLARE_IRQ_STATE;

  uint8_t context_index = fn_get_context_index(railHandle);
  assert(context_index < SUPPORTED_PROTOCOL_COUNT);

  RAIL_MUX_ENTER_CRITICAL();
  protocol_context[context_index].tx_power = power;
  fn_update_current_tx_power();
  RAIL_MUX_EXIT_CRITICAL();

  return RAIL_STATUS_NO_ERROR;
}

RAIL_Status_t sl_rail_mux_SetTxPower(RAIL_Handle_t railHandle,
                                     RAIL_TxPowerLevel_t powerLevel)
{
  RAIL_TxPowerConfig_t txPowerConfig;
  RAIL_GetTxPowerConfig(mux_rail_handle, &txPowerConfig);

  RAIL_TxPower_t power = RAIL_ConvertRawToDbm(mux_rail_handle,
                                              txPowerConfig.mode,
                                              powerLevel);
  return sl_rail_mux_SetTxPowerDbm(railHandle, power);
}

void sl_rail_mux_YieldRadio(RAIL_Handle_t railHandle)
{
  (void)railHandle;

  RAIL_YieldRadio(mux_rail_handle);
  return;
}

RAIL_RadioState_t sl_rail_mux_GetRadioState(RAIL_Handle_t railHandle)
{
  (void)railHandle;

  return RAIL_GetRadioState(mux_rail_handle);
}

uint16_t sl_rail_mux_SetTxFifo(RAIL_Handle_t railHandle,
                               uint8_t *addr,
                               uint16_t initLength,
                               uint16_t size)
{
  RAIL_MUX_DECLARE_IRQ_STATE;
  uint16_t buf_len;

  uint8_t context_index = fn_get_context_index(railHandle);
  assert(context_index < SUPPORTED_PROTOCOL_COUNT);

  if (size > RAIL_MUX_MAX_BUFFER_SIZE) {
    buf_len = RAIL_MUX_MAX_BUFFER_SIZE;
  } else if (size > 0) {
    buf_len = size;
  } else if (initLength > RAIL_MUX_MAX_BUFFER_SIZE) {
    buf_len = RAIL_MUX_MAX_BUFFER_SIZE;
  } else {
    buf_len = initLength;
  }

  RAIL_MUX_ENTER_CRITICAL();

  fn_set_context_flag_by_index(context_index, RAIL_MUX_PROTOCOL_FLAGS_SETUP_TX_FIFO, true);
  protocol_context[context_index].fifo_tx_info.data_ptr = addr;
  protocol_context[context_index].fifo_tx_info.tx_init_length = initLength;
  protocol_context[context_index].fifo_tx_info.tx_size = size;

  RAIL_MUX_EXIT_CRITICAL();

  return buf_len;
}

RAIL_Status_t sl_rail_mux_StartCcaCsmaTx(RAIL_Handle_t railHandle,
                                         uint16_t channel,
                                         RAIL_TxOptions_t options,
                                         const RAIL_CsmaConfig_t *csmaConfig,
                                         const RAIL_SchedulerInfo_t *schedulerInfo)
{
  RAIL_MUX_DECLARE_IRQ_STATE;
  uint16_t ret_status = RAIL_STATUS_INVALID_STATE;

  uint8_t context_index = fn_get_context_index(railHandle);
  assert(context_index < SUPPORTED_PROTOCOL_COUNT);

  // Reject operation if other protocol holds lock
  RAIL_MUX_ENTER_CRITICAL();
  if ( check_lock_permissions(context_index) ) {
    if (!fn_get_context_flag_by_index(context_index, RAIL_MUX_PROTOCOL_FLAGS_START_TX_PENDING)) {
      fn_set_context_flag_by_index(context_index, RAIL_MUX_PROTOCOL_FLAGS_START_TX_PENDING, true);
      protocol_context[context_index].csma_tx_info.tx_type = SINGLE_TX_CCA_CSMA_REQUEST;
      protocol_context[context_index].csma_tx_info.channel = channel;
      protocol_context[context_index].csma_tx_info.options = options;

      fn_set_context_flag_by_index(context_index,
                                   RAIL_MUX_PROTOCOL_FLAGS_CSMA_CONFIG_VALID,
                                   (csmaConfig != NULL));
      if (csmaConfig != NULL) {
        protocol_context[context_index].csma_tx_info.csmaConfig = *csmaConfig;
      }

      fn_set_context_flag_by_index(context_index,
                                   RAIL_MUX_PROTOCOL_FLAGS_SCHEDULER_INFO_VALID,
                                   (schedulerInfo != NULL));
      if (schedulerInfo != NULL) {
        protocol_context[context_index].csma_tx_info.schedulerInfo = *schedulerInfo;
      }
    }
    ret_status = fn_start_pending_tx();
  }
  RAIL_MUX_EXIT_CRITICAL();
  return ret_status;
}

RAIL_Status_t sl_rail_mux_StartTx(RAIL_Handle_t railHandle,
                                  uint16_t channel,
                                  RAIL_TxOptions_t options,
                                  const RAIL_SchedulerInfo_t *schedulerInfo)
{
  RAIL_MUX_DECLARE_IRQ_STATE;
  RAIL_Status_t ret_status = RAIL_STATUS_INVALID_STATE;

