espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/radio/mac/rail_mux/sl_rail_mux.c
HIDDEN void fn_timer_callback(struct RAIL_MultiTimer *tmr,
                              RAIL_Time_t expectedTimeOfEvent,
                              void *cbArg)
{
  (void)tmr;
  (void)expectedTimeOfEvent;

  RAIL_Handle_t railHandle = (RAIL_Handle_t)cbArg;
  uint8_t context_index = fn_get_context_index(railHandle);

  assert(context_index < SUPPORTED_PROTOCOL_COUNT);

  if (protocol_context[context_index].timer_callback != NULL) {
    protocol_context[context_index].timer_callback(railHandle);
  }
}

static bool fn_operation_in_progress(uint16_t operation_flags)
{
  uint8_t i;

  for (i = 0; i < SUPPORTED_PROTOCOL_COUNT; i++) {
    if (fn_get_context_flag_by_index(i, operation_flags)) {
      return true;
    }
  }

  return false;
}

static uint8_t fn_get_active_tx_context_index(void)
{
  uint8_t active_tx_context_index = INVALID_CONTEXT_INDEX;
  uint8_t i;

  for (i = 0; i < SUPPORTED_PROTOCOL_COUNT; i++) {
    // Protocol context not in use
    if (protocol_context[i].rail_config == NULL) {
      continue;
    }

    if (fn_get_context_flag_by_index(i, RAIL_MUX_PROTOCOL_ACTIVE_TX_FLAGS)) {
      // Enforce that only one protocol could be in "active TX" state
      assert(active_tx_context_index == INVALID_CONTEXT_INDEX);
      active_tx_context_index = i;
    }
  }

  return active_tx_context_index;
}

HIDDEN void fn_mux_rail_events_callback(RAIL_Handle_t railHandle, RAIL_Events_t events)
{
  (void)railHandle;
  RAIL_RxPacketInfo_t rx_info, data_req_Info;
  RAIL_RxPacketHandle_t rx_packet_handle;
  RAIL_RxPacketDetails_t packet_details;
  bool start_pending_tx = false;
  uint8_t active_tx_protocol_index = fn_get_active_tx_context_index();
  uint8_t i;

  if (events & RAIL_EVENT_RX_PACKET_RECEIVED) {
    rx_packet_handle = RAIL_GetRxPacketInfo(mux_rail_handle,
                                            RAIL_RX_PACKET_HANDLE_NEWEST,
                                            &rx_info);
    assert(RAIL_GetRxPacketDetailsAlt(mux_rail_handle,
                                      rx_packet_handle,
                                      &packet_details) == RAIL_STATUS_NO_ERROR);
  }

  if (events & RAIL_EVENT_IEEE802154_DATA_REQUEST_COMMAND) {
    RAIL_GetRxIncomingPacketInfo(railHandle, &data_req_Info);
  }

  // Bubble up only events that should be raised to each protocol.
  for (i = 0; i < SUPPORTED_PROTOCOL_COUNT; i++) {
    RAIL_Events_t enabled_events = (protocol_context[i].events & events);

    // This protocol context is not in use
    if (protocol_context[i].rail_config == NULL) {
      continue;
    }

    if (enabled_events & RAIL_EVENTS_TX_COMPLETION) {
      if (i != active_tx_protocol_index) {
        enabled_events &= ~RAIL_EVENTS_TX_COMPLETION;
      } else {
        uint16_t unused_tail = protocol_context[i].fifo_tx_info.tx_size - protocol_context[i].fifo_tx_info.tx_init_length;
        uint16_t unused = RAIL_GetTxFifoSpaceAvailable(mux_rail_handle);
        if (unused > unused_tail) {
          uint16_t unused_head = unused - unused_tail;
          memmove(protocol_context[i].fifo_tx_info.data_ptr,
                  protocol_context[i].fifo_tx_info.data_ptr + unused_head,
                  protocol_context[i].fifo_tx_info.tx_size - unused);
        }

        protocol_context[i].fifo_tx_info.tx_init_length =
          protocol_context[i].fifo_tx_info.tx_size - unused;

        if (!RAIL_GetTxPacketsRemaining(mux_rail_handle)) {
          fn_set_context_flag_by_index(i, RAIL_MUX_PROTOCOL_FLAGS_TX_IN_PROGRESS, false);
          fn_set_context_flag_by_index(i, RAIL_MUX_PROTOCOL_FLAGS_TX_SCHEDULED, false);
        }
        if (!(enabled_events & RAIL_EVENT_TX_PACKET_SENT)) {
          // Any event other than a successful packet sent would unset the wait
          // for ack flag.
          fn_set_context_flag_by_index(i, RAIL_MUX_PROTOCOL_FLAGS_WAIT_FOR_ACK, false);
        }

        if (!tx_in_progress()) {
          start_pending_tx = true;
        }
      }
    }

    // We got a SCHEDULED_TX_STARTED event: we transition the protocol that
    // originally invoked the StartScheduledTX() API to "tx in progress".
    if (events & RAIL_EVENT_SCHEDULED_TX_STARTED) {
      if (fn_get_context_flag_by_index(i, RAIL_MUX_PROTOCOL_FLAGS_TX_SCHEDULED)) {
        fn_set_context_flag_by_index(i, RAIL_MUX_PROTOCOL_FLAGS_TX_IN_PROGRESS, true);
        fn_set_context_flag_by_index(i, RAIL_MUX_PROTOCOL_FLAGS_TX_SCHEDULED, false);
      } else {
        enabled_events &= ~RAIL_EVENT_SCHEDULED_TX_STARTED;
      }
    }

    if (events & RAIL_EVENT_RX_SCHEDULED_RX_END) {
      if (fn_get_context_flag_by_index(i, RAIL_MUX_PROTOCOL_FLAGS_RX_SCHEDULED)) {
        fn_set_context_flag_by_index(i, RAIL_MUX_PROTOCOL_FLAGS_RX_SCHEDULED, false);
      } else {
        enabled_events &= ~RAIL_EVENT_RX_SCHEDULED_RX_END;
      }
    }

    if (enabled_events & RAIL_EVENT_RX_PACKET_RECEIVED) {
      // The protocol is currently on a different channel or idling or the
      // packet did not satisfy any of the protocol filtering: we mask out the
      // RAIL_EVENT_RX_PACKET_RECEIVED event.
      if (rx_channel != protocol_context[i].channel
          // MAC Acks do not contain any addressing information
          // Do not check for filterMask on Rx packets that are acks
          || (!packet_details.isAck && (rx_info.filterMask & protocol_context[i].addr_filter_mask_802154) == 0)
          || (packet_details.isAck && (i != active_tx_protocol_index)) ) {
        enabled_events &= ~RAIL_EVENT_RX_PACKET_RECEIVED;
      } else {
        if (packet_details.isAck) {
          fn_set_context_flag_by_index(i, RAIL_MUX_PROTOCOL_FLAGS_WAIT_FOR_ACK, false);
          start_pending_tx = true;
        }
      }
    }

    // Deal with ACK timeout after possible RX completion in case RAIL
    // notifies us of the ACK and the timeout simultaneously -- we want
    // the ACK to win over the timeout.
    if (enabled_events & (RAIL_EVENT_RX_ACK_TIMEOUT | RAIL_EVENT_CONFIG_UNSCHEDULED)) {
      if ( i != active_tx_protocol_index) {
        enabled_events &= ~(RAIL_EVENT_RX_ACK_TIMEOUT | RAIL_EVENT_CONFIG_UNSCHEDULED);
      } else if (fn_get_context_flag_by_index(i, RAIL_MUX_PROTOCOL_FLAGS_WAIT_FOR_ACK)) {
        fn_set_context_flag_by_index(i, RAIL_MUX_PROTOCOL_FLAGS_WAIT_FOR_ACK, false);
        start_pending_tx = true;
      }
    }

    if (enabled_events & RAIL_EVENT_IEEE802154_DATA_REQUEST_COMMAND) { // ToDo: do we also need to check the packet type?
      if (rx_channel != protocol_context[i].channel
          || (data_req_Info.filterMask & protocol_context[i].addr_filter_mask_802154) == 0) {
        enabled_events &= ~RAIL_EVENT_IEEE802154_DATA_REQUEST_COMMAND;
      } else {
      }
    }

    if ((enabled_events) != 0) {
      protocol_context[i].rail_config->eventsCallback(&protocol_context[i],
                                                      enabled_events);
    }
  }

  if (start_pending_tx) {
    fn_start_pending_tx();
  }
}

// TODO: We do not prioritize the next protocol within this function if we need
// any kind of priority taking place we need to add that in.
static RAIL_Status_t fn_start_pending_tx(void)
{
  uint8_t i;

  // We are currently TXing, nothing to do.
  if (tx_in_progress()) {
    return RAIL_STATUS_NO_ERROR;
  }
  // Set the TX power before starting a new transmission if there is a pending
  // setTXpower to be done.
  fn_update_current_tx_power();

